<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"0f87d438fd6dc92439dd20f88ab73d902b9a0d9c60f3eebfb70c63d54ebc3339","plan_job_ref":"Job Create terraform plan #7 at https://github.com/Emeric-hub/infra-experiments/actions/runs/5272075497","plan_hash":"7400ae1a2af4aa1da6eff6602307045b2f7be42e51e09a86746112d0e0bb1690","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __LOCAL-Proxmox/terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_vm_qemu.ubuntu-terraform will be created
  + resource "proxmox_vm_qemu" "ubuntu-terraform" {
      + additional_wait           = 5
      + agent                     = 1
      + automatic_reboot          = true
      + balloon                   = 768
      + bios                      = "seabios"
      + boot                      = (known after apply)
      + bootdisk                  = (known after apply)
      + clone                     = "ubuntu2204-cloud-master"
      + clone_wait                = 10
      + cores                     = 1
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "cpu,memory,network,disk,usb"
      + id                        = (known after apply)
      + kvm                       = true
      + memory                    = 2048
      + name                      = "ubuntu-terraform"
      + nameserver                = (known after apply)
      + numa                      = true
      + onboot                    = false
      + oncreate                  = true
      + os_type                   = "ubuntu"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-single"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + tags                      = "terraform"
      + target_node               = "proxmox"
      + unused_disk               = (known after apply)
      + vcpus                     = 2
      + vlan                      = -1
      + vmid                      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #7](https://github.com/Emeric-hub/infra-experiments/actions/runs/5272075497)